[
  {
    "id": "1",
    "name": "Demon's Souls - Fluted Armor Figure",
    "description": "A 15cm/5.9inches highly detailed collectible figure of a Demon's Souls player character, clad in iconic armor with swords and shields. Perfect for fans of the series.",
    "price": "60.00",
    "images": [
      "/dsfigure1.avif",
      "/dsfigure2.avif",
      "/dsfigure3.avif",
      "/dsfigure4.avif",
      "/dsfigure5.avif"
    ]
  },
  {
    "id": "2",
    "name": "Arthas Menethil – Fall of the Lich King Figure",
    "description": "A 18cm/7inches premium collectible figure of Arthas Menethil as the Lich King, featuring Frostmourne, intricate armor details, and a frozen base inspired by Icecrown Citadel.",
    "price": "60.00",
    "images": [
      "/lichking.png"
    ]
  },    
  {
    "id": "3",
    "name": "Warglaives of Azzinoth - World of Warcraft Figure",
    "description": "A detailed collectible figure of the Warglaives of Azzinoth from World of Warcraft. Features 22cm dual-bladed weapons with glowing green accents, demonic runes, and a display stand.",
    "price": "50.00",
    "images": [
      "/warglaive1.png",
      "/warglaive2.png",
      "/warglaive3.png"
    ]
  },  
  {
    "id": "4",
    "name": "World of Warcraft - Horde T-Shirt",
    "description": "Proudly display your loyalty to Azeroth's mightiest faction with this premium Horde t-shirt! Featuring the iconic crimson emblem on soft, breathable fabric, this World of Warcraft tee lets you declare 'For the Horde!' in style. Perfect for raids, conventions, or casual wear. Limited stock - claim your battle gear today!",
    "price": "30.00",
    "images": [
      "/shirt1.png",
      "/shirt2.png",
      "/shirt3.png"
    ],
    "variant": {
      "colors": ["Black", "White", "Beige"],
      "sizes": ["S", "M", "L"]
    }
  },
  {
    "id": "5",
    "name": "Alliance Champion T-Shirt",
    "description": "Represent the noble Alliance in this high-quality, World of Warcraft t-shirt! Boldly display the blue lion crest on ultra-comfortable fabric, perfect for adventurers, PvP battles, or showing your pride at gaming events. Join other heroes within your favorite faction!",
    "price": "30.00",
    "images": [
      "/shirt4.png",
      "/shirt5.png",
      "/shirt6.png"
    ],
    "variant": {
      "colors": ["White", "Blue", "Black"],
      "sizes": ["S", "M", "L"]
    }
  },
  {
    "id": "6",
    "name": "Wireless Earphones - Touchscreen",
    "description": "Experience the future of audio with these premium wireless earphones featuring a smart touchscreen display on the charging case. Easily control playback, check battery levels, and manage calls with a tap. Perfect for workouts, commutes, and all-day use.",
    "price": "30.00",
    "images": [
      "/earphones1.png",
      "/earphones2.png",
      "/earphones3.avif",
      "/earphones4.avif"
    ],
    "variant": {
      "colors": ["White", "Black"]
    }
  },
  {
    "id": "7",
    "name": "NextGen Smart Watch",
    "description": "Stay connected and track your health in style with the NextGen Smart Watch. Features heart rate monitoring, step tracking, notifications, customizable watch faces, and long battery life. A sleek, everyday wearable for tech-savvy users.",
    "price": "18.00",
    "images": [
      "/watch1.png",
      "/watch2.png",
      "/watch3.png"
    ],
    "variant": {
      "colors": ["Pink", "Black", "Gold"]
    }
  }    
]